IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_TIMER0_CFG.xml
<module name="MCU_TIMER0_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CFG_TIDR" acronym="CFG_TIDR" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x1" description="Business Unit" range="29 - 28" rwaccess="R"/> 
		<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x0" description="Module ID" range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x7" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_TIOCP_CFG" acronym="CFG_TIOCP_CFG" offset="0x10" width="32" description="This register controls the various parameters of the OCP interface ">
		<bitfield id="IDLEMODE" width="2" begin="3" end="2" resetval="0x2" description="Idle Mode" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="EMUFREE" width="1" begin="1" end="1" resetval="0x0" description="Emulation Mode" range="1" rwaccess="R/W"/> 
		<bitfield id="SOFTRESET" width="1" begin="0" end="0" resetval="0x0" description="Software reset" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_IRQ_EOI" acronym="CFG_IRQ_EOI" offset="0x20" width="32" description="Allows the generation of further pulses on the interrupt line, if an new interrupt event is pending, when using the pulsed output. Unused when using the level interrupt line">
		<bitfield id="LINE_NUMBER" width="1" begin="0" end="0" resetval="0x0" description="Idle Mode" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_IRQSTATUS_RAW" acronym="CFG_IRQSTATUS_RAW" offset="0x24" width="32" description="Component interrupt request status.
Check the corresponding secondary status register. Raw status is set even if event is not enabled. Write 1 to set the (raw) status, mostly for debug">
		<bitfield id="TCAR_IT_FLAG" width="1" begin="2" end="2" resetval="0x0" description="Capture Interrupt" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="OVF_IT_FLAG" width="1" begin="1" end="1" resetval="0x0" description="Overflow Interrupt" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="MAT_IT_FLAG" width="1" begin="0" end="0" resetval="0x0" description="Match Interrupt" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CFG_IRQSTATUS" acronym="CFG_IRQSTATUS" offset="0x28" width="32" description="Component  interrupt request status.
Check the corresponding secondary status register.Enabled status isn't set unless event is enabled.Write 1 to clear the status after interrupt has been serviced;raw status gets cleared, i.e. even if not enabled">
		<bitfield id="TCAR_IT_FLAG" width="1" begin="2" end="2" resetval="0x0" description="Capture Interrupt" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="OVF_IT_FLAG" width="1" begin="1" end="1" resetval="0x0" description="Overflow Interrupt" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="MAT_IT_FLAG" width="1" begin="0" end="0" resetval="0x0" description="Match Interrupt" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG_IRQSTATUS_SET" acronym="CFG_IRQSTATUS_SET" offset="0x2C" width="32" description="Component interrupt request enable
Write 1 to set;enable interrupt. 
Readout equal to corresponding _CLR register.">
		<bitfield id="TCAR_IT_FLAG" width="1" begin="2" end="2" resetval="0x0" description="Capture Interrupt" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="OVF_IT_FLAG" width="1" begin="1" end="1" resetval="0x0" description="Overflow Interrupt" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="MAT_IT_FLAG" width="1" begin="0" end="0" resetval="0x0" description="Match Interrupt" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CFG_IRQSTATUS_CLR" acronym="CFG_IRQSTATUS_CLR" offset="0x30" width="32" description=" Component interrupt request enable.
Write 1 to clear; disable interrupt.
Readout equal to corresponding _SET register">
		<bitfield id="TCAR_IT_FLAG" width="1" begin="2" end="2" resetval="0x0" description="Capture Interrupt" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="OVF_IT_FLAG" width="1" begin="1" end="1" resetval="0x0" description="Overflow Interrupt" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="MAT_IT_FLAG" width="1" begin="0" end="0" resetval="0x0" description="Match Interrupt" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG_IRQWAKEEN" acronym="CFG_IRQWAKEEN" offset="0x34" width="32" description="Wakeup-enabled events taking place when module is idle shall generate an asynchronous wakeup">
		<bitfield id="MAT_WUP_ENA" width="1" begin="2" end="2" resetval="0x0" description="Match Wakeup Enable" range="2" rwaccess="R/W"/> 
		<bitfield id="OVF_WUP_ENA" width="1" begin="1" end="1" resetval="0x0" description="Overflow Wakeup Enable" range="1" rwaccess="R/W"/> 
		<bitfield id="TCAR_WUP_ENA" width="1" begin="0" end="0" resetval="0x0" description="Capture Wakeup Enable" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TCLR" acronym="CFG_TCLR" offset="0x38" width="32" description="This register controls optional features specific to the timer functionality">
		<bitfield id="GPO_CFG" width="1" begin="14" end="14" resetval="0x0" description="This field drives directly the timer_gpocfg port" range="14" rwaccess="R/W"/> 
		<bitfield id="CAPT_MODE" width="1" begin="13" end="13" resetval="0x0" description="Capture mode select bit; First/second" range="13" rwaccess="R/W"/> 
		<bitfield id="PT" width="1" begin="12" end="12" resetval="0x0" description="Pulse or Toggle select bit" range="12" rwaccess="R/W"/> 
		<bitfield id="TRG" width="2" begin="11" end="10" resetval="0x0" description="Trigger Output Mode" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="TCM" width="2" begin="9" end="8" resetval="0x0" description="Transition Capture Mode" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SCPWM" width="1" begin="7" end="7" resetval="0x0" description="Pulse Width Modulation output pin default value" range="7" rwaccess="R/W"/> 
		<bitfield id="CE" width="1" begin="6" end="6" resetval="0x0" description="Compare Enable" range="6" rwaccess="R/W"/> 
		<bitfield id="PRE" width="1" begin="5" end="5" resetval="0x0" description="Prescaler Enable" range="5" rwaccess="R/W"/> 
		<bitfield id="PTV" width="3" begin="4" end="2" resetval="0x0" description="Trigger Output Mode. The timer counter is prescaled with the value: 2^PTV" range="4 - 2" rwaccess="R/W"/> 
		<bitfield id="AR" width="1" begin="1" end="1" resetval="0x0" description="Auto-reload mode" range="1" rwaccess="R/W"/> 
		<bitfield id="ST" width="1" begin="0" end="0" resetval="0x0" description="Start/Stop timer control" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TCRR" acronym="CFG_TCRR" offset="0x3C" width="32" description="This register holds the value of the internal counter">
		<bitfield id="TIMER_COUNTER" width="32" begin="31" end="0" resetval="0x0" description="Timer Counter" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TLDR" acronym="CFG_TLDR" offset="0x40" width="32" description="This register holds the timer's load value">
		<bitfield id="LOAD_VALUE" width="32" begin="31" end="0" resetval="0x0" description="Timer Counter" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TTGR" acronym="CFG_TTGR" offset="0x44" width="32" description="This register triggers a counter reload of timer by writing any value in it">
		<bitfield id="TTRG_VLAUE" width="32" begin="31" end="0" resetval="0x0" description="The value of the trigger register. During reads, it always return 0xFFFF_FFFF" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TWPS" acronym="CFG_TWPS" offset="0x48" width="32" description="This register contains the write posting bits for all writ-able functional registers">
		<bitfield id="W_PEND_TOWR" width="1" begin="9" end="9" resetval="0x0" description="Write pending for register TOWR" range="9" rwaccess="R"/> 
		<bitfield id="W_PEND_TOCR" width="1" begin="8" end="8" resetval="0x0" description="Write pending for register TOCR" range="8" rwaccess="R"/> 
		<bitfield id="W_PEND_TCVR" width="1" begin="7" end="7" resetval="0x0" description="Write pending for register TCVR" range="7" rwaccess="R"/> 
		<bitfield id="W_PEND_TNIR" width="1" begin="6" end="6" resetval="0x0" description="Write pending for register TNIR" range="6" rwaccess="R"/> 
		<bitfield id="W_PEND_TPIR" width="1" begin="5" end="5" resetval="0x0" description="Write pending for register TPIR" range="5" rwaccess="R"/> 
		<bitfield id="W_PEND_TMAR" width="1" begin="4" end="4" resetval="0x0" description="Write pending for register TMAR" range="4" rwaccess="R"/> 
		<bitfield id="W_PEND_TTGR" width="1" begin="3" end="3" resetval="0x0" description="Write pending for register TTGR" range="3" rwaccess="R"/> 
		<bitfield id="W_PEND_TLDR" width="1" begin="2" end="2" resetval="0x0" description="Write pending for register TLDR" range="2" rwaccess="R"/> 
		<bitfield id="W_PEND_TCRR" width="1" begin="1" end="1" resetval="0x0" description="Write pending for register TCRR" range="1" rwaccess="R"/> 
		<bitfield id="W_PEND_TCLR" width="1" begin="0" end="0" resetval="0x0" description="Write pending for register TCLR" range="0" rwaccess="R"/>
	</register>
	<register id="CFG_TMAR" acronym="CFG_TMAR" offset="0x4C" width="32" description="This register holds the match value to be compared with the counter's value">
		<bitfield id="COMPARE_VLAUE" width="32" begin="31" end="0" resetval="0x0" description="The value of the match register" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TCAR1" acronym="CFG_TCAR1" offset="0x50" width="32" description="This register holds the value of the first counter register capture">
		<bitfield id="CAPTURE_VALUE1" width="32" begin="31" end="0" resetval="0x0" description="The value of first captured counter register" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_TSICR" acronym="CFG_TSICR" offset="0x54" width="32" description="Timer Synchronous Interface Control Register">
		<bitfield id="READ_AFTER_IDLE" width="1" begin="4" end="4" resetval="0x0" description="Select if the synchronization mechanism used for first TCRR read operation after IDLE state is active" range="4" rwaccess="W"/> 
		<bitfield id="READ_MODE" width="1" begin="3" end="3" resetval="0x0" description="Select posted/non-posted mode for read operation. This bit is not used when configured in posted mode" range="3" rwaccess="W"/> 
		<bitfield id="POSTED" width="1" begin="2" end="2" resetval="0x0" description="Reset value of POSTED depends on hardware integration module at design time. Software must read POSTED field to get the hardwar module configuration" range="2" rwaccess="R/W"/> 
		<bitfield id="SFT" width="1" begin="1" end="1" resetval="0x0" description="This bit reset all the functional part of teh module" range="1" rwaccess="R/W"/>
	</register>
	<register id="CFG_TCAR2" acronym="CFG_TCAR2" offset="0x58" width="32" description="This register holds the value of the second counter register capture">
		<bitfield id="CAPTURE_VALUE2" width="32" begin="31" end="0" resetval="0x0" description="The value of second captured counter register" range="31 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_TPIR" acronym="CFG_TPIR" offset="0x5C" width="32" description=" This register is used for 1ms tick generation.
The TPIR register holds the value of the positive increment. The value of this register is added with the value of the TCVR to define whether next value loaded in TCRR will be the sub-period  value or the over-period value">
		<bitfield id="POSITIVE_INC_VALUE" width="32" begin="31" end="0" resetval="0x0" description="The value of the positive increment" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TNIR" acronym="CFG_TNIR" offset="0x60" width="32" description="This register is used for 1ms tick generation.  
The TNIR register holds the value of the negative increment. The value of this register is added with the value of the TCVR to define whether next value loaded in TCRR will be the sub-period  value or the over-period value">
		<bitfield id="NEGATIVE_INC_VALUE" width="32" begin="31" end="0" resetval="0x0" description="The value of the negative increment" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TCVR" acronym="CFG_TCVR" offset="0x64" width="32" description=" This register is used for 1ms tick generation.
The TCVR register defines whether next value loaded in TCRR will be the sub-period  value or the over-period value">
		<bitfield id="COUNTER_VALUE" width="32" begin="31" end="0" resetval="0x0" description="The value of CVR counter" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TOCR" acronym="CFG_TOCR" offset="0x68" width="32" description="This register is used to mask the tick interrupt for a selected number of ticks">
		<bitfield id="OVF_COUNTER_VALUE" width="24" begin="23" end="0" resetval="0x0" description="The number of overflow events" range="23 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TOWR" acronym="CFG_TOWR" offset="0x6C" width="32" description="This register holds the number of masked overflow interrupts">
		<bitfield id="OVF_WRAPPING_VALUE" width="24" begin="23" end="0" resetval="0x0" description="The number of masked interrupts" range="23 - 0" rwaccess="R/W"/>
	</register>
</module>